Tekla Open API Reference for Tekla Structures 2025
PointPlacingType Class
 The PointPlacingType class defines a placing type where the object is placed at one point (the insertion point) without any additional placing options.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.PointPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PointPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class PointPlacingType
	Inherits PreferredPlacingTypeBase
The PointPlacingType type exposes the following members.
Constructors
Name | Description
PointPlacingType
 Creates a new point placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace